Repository: aggellos2001/SharpPDFCompressor
Catalog: SharpPDFCompressor/Strings/*/Resources.resw
Source language: en_us
Languages: el_gr

# FilePathTextBox.Description
source: You can also drag a file here instead!
el_gr: Μπορείτε επίσης να σύρετε ένα αρχείο / φάκελο εδώ!

# HomeTitle.Text
source: Home
el_gr: Αρχική

# LowCompressionButton.Content
source: Low
el_gr: Χαμηλή

# MaxCompressionButton.Content
source: Max (not recommended)
el_gr: Μέγιστη (δεν συνίσταται)

# MediumCompressionButton.Content
source: Medium
el_gr: Μέτρια

# PickFileButton.Text
source: Select a file
el_gr: Επιλέξτε ένα αρχείο

# PickFolderButton.Text
source: Pick a folder
el_gr: Επιλέξτε ένα φάκελο

# HomeSubTitle.Text
source: You can compress a single .pdf file or all the .pdf files inside a folder and its subfolders. You can also compress all the .pdf files inside an archive file (.zip, tar.gz, etc.)
el_gr: Μπορείτε να συμπιέσετε ένα αρχείο .pdf ή όλα τα αρχεία που συμπεριλαμβάνονται σε ένα φάκελο και τους υποφακέλους. Μπορείτε επίσης να συμπιέσετε όλα τα .pdf αρχεία που βρίσκονται μέσα σε συμπιεσμένα αρχεία (.zip, .tar.gz κλπ)

# HighCompressionButton.Content
source: High
el_gr: Υψηλή

# InnerCompressButton.Text
source: Compress
el_gr: Συμπίεση

# CompressionLevelGroup.Header
source: Compression Level
el_gr: Επίπεδο συμπίεσης

# HomePageButton.Content
source: Home
el_gr: Αρχική

# DragUICaption
source: Drag and drop here!
el_gr: Σύρετε και αφήστε εδώ!

# FilePathTextBox.PlaceholderText
source: No file or folder selected
el_gr: Δεν επιλέχθηκε κάποιο αρχείο ή φάκελος ακόμα

source: Compressing
el_gr: Συμπίεση

source: Success
el_gr: Επιτυχία

source: Failure
el_gr: Αποτυχία

source: Cancel
el_gr: Ακύρωση

source: Finish
el_gr: Τέλος

# CopiedErrorTeachingTip.Title
source: The error is copied to the clipboard
el_gr: Το μήνυμα σφάλματος αντιγράφηκε στο πρόχειρο επιτυχώς.

# SettingsTitle.Text
source: About
el_gr: Σχετικά με

# InvalidFileException
source: The file you chose is not a .pdf file or does not exist.
el_gr: Το αρχείο που επιλέξατε δεν είναι pdf ή δεν υπάρχει.

# CompressionLevelGroup.Description
source: Select between 4 different levels of compression.
el_gr: Επιλέξτε μεταξύ τεσσάρων επιπέδων συμπίεσης

# DeleteOriginalFilesSwitch.Header
source: Delete original pdf files
el_gr: Διαγραφή των αρχικών .pdf αρχείων

# DeleteOriginalFilesSwitch.Description
source: When enabled, all compressed PDF files are deleted. This option does not apply when compressing PDF files inside a compressed archive because each time a new copy is generated.
el_gr: Όταν είναι ενεργή η επιλογή, όλα τα αρχικά .pdf αρχεία διαγράφονται. Αυτό δεν ισχύει στα συμπιεσμένα αρχεία καθώς κάθε φορά δημιουργείται ένα νέο αντίγραφο.

# GenericError
source: An unexpected error occurred. If this persist, please report it to the developer!
el_gr: Προέκυψε ένα μη αναμενόμενο σφάλμα. Αν αυτό συνεχιστεί ενημερώστε τον προγραμματιστή!

# LicenseExpander.Header
source: View the libraries used and their licenses
el_gr: Δείτε τις άδειες λογισμικού των βιβλιοθηκών που χρησιμοποιήθηκαν

# GithubButton.Header
source: Source code
el_gr: Πηγαίος κώδικας

# GithubButton.Description
source: This app uses open-source libraries like ghostscript to provide you with pdf compressing capabilities. I welcome and encourage contributions to the code of this application. You can review the modified code on GitHub.
el_gr: Αυτή η εφαρμογή χρησιμοποιεί βιβλιοθήκες ανοιχτού κώδικα όπως το ghostscript για να παρέχει μέρος των δυνατοτήτων της όπως η συμπίεση PDF αρχείων. Κάθε είδους συνεισφορά είναι ευπρόσδεκτη. Μπορείτε να δείτε τον πηγαίο κώδικα στο GitHub.

# LogoAttribution.Header
source: Application icon
el_gr: Εικονίδιο εφαρμογής

# LogoAttribution.Description
source: Many thanks to my friend Apostolos Paschalis for creating the application icon. Check out his LinkedIn profile for more.
el_gr: Ευχαριστώ τον φίλο μου Απόστολο Πασχάλη για την δημιουργία του εικονιδίου της εφαρμογής. Μπορείτε να επισκεφτείτε το LinkedIn προφίλ του για περισσότερες πληροφορίες.

# CancelOperation
source: Cancelling operation...
el_gr: Ακύρωση συμπίεσης...

# CancelOperationExplanation
source: Waiting for the current compression operation to finish. It might take a while.
el_gr: Σε αναμονή ακύρωσης της συμπίεσης. Η ακύρωση μπορεί να διαρκέσει λίγη ώρα.

source: Please wait
el_gr: Παρακαλώ περιμένετε

# ParallelismLevel.Header
source: Parallelism Level
el_gr: Επίπεδο παραλληλισμού

# ParallelismLevel.Description
source: Select the number of workers for parallel compression. This can help speed up the operation when you have multiple cores available.
el_gr: Επιλέξτε τον αριθμό παράλληλων συμπιέσεων. Αυτή η ρύθμιση μπορεί να βοηθήσει στην ταχύτητα συμπίεσης εφόσον ο υπολογιστής διαθέτει πολλαπλούς πυρήνες.
